Delans-TLE/src/Catalogs/ХозяйствующиеСубъектыВЕТИС/ХозяйствующиеСубъектыВЕТИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХозяйствующиеСубъектыВЕТИС</name>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторВерсии</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыВерсионныхОбъектовВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыХозяйствующихСубъектовВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеАдреса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <comment>Внутренние значения полей адреса (контактная информация)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствуетОрганизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.ОрганизацияКонтрагентВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяЗагрузка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПредприятий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьНесопоставленные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Предприятия</name>
    <attributes>
      <name>Предприятие</name>
      <type>
        <types>CatalogRef.ПредприятияВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>GLN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТорговыйОбъект</name>
      <type>
        <types>DefinedType.ТорговыйОбъектВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроизводственныйОбъект</name>
      <type>
        <types>DefinedType.ПроизводственныйОбъектВЕТИС</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Delans-TLE/src/Catalogs/ПредприятияВЕТИС/ПредприятияВЕТИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПредприятияВЕТИС</name>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторВерсии</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыВерсионныхОбъектовВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыПредприятийВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеАдреса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <comment>Внутренние значения полей адреса (контактная информация)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяЗагрузка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаИдентификатор</name>
    <comment>Глобальный идентификатор страны в соответствии со справочником РСХН</comment>
    <type>
      <types>DefinedType.УникальныйИдентификаторВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>РегионИдентификатор</name>
    <comment>Глобальный идентификатор региона в соответствии со справочником РСХН</comment>
    <type>
      <types>DefinedType.УникальныйИдентификаторВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>РайонИдентификатор</name>
    <comment>Глобальный идентификатор района в соответствии со справочником РСХН</comment>
    <type>
      <types>DefinedType.УникальныйИдентификаторВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>НаселенныйПунктИдентификатор</name>
    <comment>Глобальный идентификатор населенного пункта в соответствии со справочником РСХН</comment>
    <type>
      <types>DefinedType.УникальныйИдентификаторВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВРеестре</name>
    <type>
      <types>EnumRef.СтатусыПредприятийВРеестреЦерберВЕТИС</types>
    </type>
  </attributes>
</mdclass:Catalog>

Delans-TLE/src/Catalogs/ХозяйствующиеСубъектыВЕТИС/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Ссылка");
	Поля.Добавить("Наименование");
	Поля.Добавить("ТребуетсяЗагрузка");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если Данные.ТребуетсяЗагрузка = Истина Тогда
		СтандартнаяОбработка = Ложь;
		Представление = НСтр("ru = '<не загружено>'");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция возвращает ссылку на хозяйствующий субъект и значение реквизита по идентификатору
//
// Параметры:
//  Идентификатор - ОпределяемыйТип.УникальныйИдентификаторВЕТИС - идентификатор
// 
// Возвращаемое значение:
//  Структура - результат поиска с полями
//   * Ссылка                   - СправочникСсылка.ХозяйствующиеСубъектыВЕТИС - хозяйствующий субъект
//   * СоответствуетОрганизации - Булево - значение реквизита
//
Функция ХозяйствующийСубъектСоответствуетОрганизации(Идентификатор) Экспорт
	
	Результат = Новый Структура("Ссылка, СоответствуетОрганизации", Неопределено, Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Субъект.Ссылка КАК Ссылка,
	|	Субъект.СоответствуетОрганизации КАК СоответствуетОрганизации
	|ИЗ
	|	Справочник.ХозяйствующиеСубъектыВЕТИС КАК Субъект
	|ГДЕ
	|	Субъект.Идентификатор = &Идентификатор
	|	И НЕ Субъект.ПометкаУдаления
	|;";
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат
	
КонецФункции

// Функция - Предприятия хозяйствующего субъекта
//
// Параметры:
//  ХозяйствующийСубъектСсылка	 - СправочникСсылка.ХозяйствующиеСубъектыВЕТИС - хозяйствующий субъект
// 
// Возвращаемое значение:
//  Массив - массив предприятий хозяйствующего субъекта
//
Функция ПредприятияХозяйствующегоСубъекта(ХозяйствующийСубъектСсылка) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",ХозяйствующийСубъектСсылка);
	Запрос.Текст = "ВЫБРАТЬ
	|	Субъект.Предприятие КАК Предприятие
	|ИЗ
	|	Справочник.ХозяйствующиеСубъектыВЕТИС.Предприятия КАК Субъект
	|ГДЕ
	|	Субъект.Ссылка = &Ссылка
	|;";
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Предприятие");
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат
	
КонецФункции

// Функция Функция осуществляет поиск соответствия данных ВетИС по прикладным реквизитам
// 
// Параметры:
//  ОрганизацияКонтрагентВЕТИС			 - ОпределяемыйТип.ОрганизацияКонтрагентВЕТИС - организация
//  ТорговыйПроизводственныйОбъектВЕТИС	 - ОпределяемыйТип.ТорговыйОбъектВЕТИС, ОпределяемыйТип.ПроизводственныйОбъектВЕТИС - склад или подразделение
// 
// Возвращаемое значение:
//  Структура - найденное соответствие, см. ХозяйствующийСубъектИПредприятие()
//
//
Функция ХозяйствующийСубъектИПредприятиеПоПрикладнымРеквизитам(ОрганизацияКонтрагентВЕТИС, ТорговыйПроизводственныйОбъектВЕТИС) Экспорт
	
	Если Метаданные.ОпределяемыеТипы.ТорговыйОбъектВЕТИС.Тип.СодержитТип(ТипЗнч(ТорговыйПроизводственныйОбъектВЕТИС)) Тогда
		Возврат ХозяйствующийСубъектИПредприятиеПоОрганизацииИСкладу(ОрганизацияКонтрагентВЕТИС, ТорговыйПроизводственныйОбъектВЕТИС);
	Иначе
		Возврат ХозяйствующийСубъектИПредприятиеПоОрганизацииИПодразделению(ОрганизацияКонтрагентВЕТИС, ТорговыйПроизводственныйОбъектВЕТИС);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция возвращает структуру с полями "Хозяйствующий субъект", "Предприятие"
// 
// Возвращаемое значение:
//  Структура - структура с полями
//   * ХозяйствующийСубъект - СправочникСсылка.ХозяйствующиеСубъектыВЕТИС (пустая ссылка)
//   * Предприятие          - СправочникСсылка.ПредприятияВЕТИС (пустая ссылка)
//
Функция ХозяйствующийСубъектИПредприятие()
	
	Результат = Новый Структура;
	Результат.Вставить("ХозяйствующийСубъект", Справочники.ХозяйствующиеСубъектыВЕТИС.ПустаяСсылка());
	Результат.Вставить("Предприятие",          Справочники.ПредприятияВЕТИС.ПустаяСсылка());
	Возврат Результат;
	
КонецФункции

// Функция осуществляет поиск соответствия данных ВетИС по прикладным реквизитам
//
// Параметры:
//  Организация	 - ОпределяемыйТип.ОрганизацияКонтрагентВЕТИС - организация
//  Склад		 - ОпределяемыйТип.ТорговыйОбъектВЕТИС - склад
// 
// Возвращаемое значение:
//  Структура - найденное соответствие, см. ХозяйствующийСубъектИПредприятие()
//
Функция ХозяйствующийСубъектИПредприятиеПоОрганизацииИСкладу(Организация,Склад)
	
	Результат = ХозяйствующийСубъектИПредприятие();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Склад"      , Склад);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Субъект.Ссылка КАК ХозяйствующийСубъект,
	|	ЕСТЬNULL(СубъектПредприятия.Предприятие, ЗНАЧЕНИЕ(Справочник.ПредприятияВЕТИС.ПустаяСсылка)) КАК Предприятие
	|ИЗ
	|	Справочник.ХозяйствующиеСубъектыВЕТИС КАК Субъект
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХозяйствующиеСубъектыВЕТИС.Предприятия КАК СубъектПредприятия
	|		ПО Субъект.Ссылка = СубъектПредприятия.Ссылка
	|		И СубъектПредприятия.ТорговыйОбъект = &Склад
	|ГДЕ
	|	НЕ Субъект.ПометкаУдаления
	|	И Субъект.Контрагент = &Организация";
	
	УстановитьПривилегированныйРежим(Истина);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

// Функция осуществляет поиск соответствия данных ВетИС по прикладным реквизитам
//
// Параметры:
//  Организация		 - ОпределяемыйТип.ОрганизацияКонтрагентВЕТИС - организация
//  Подразделение	 - ОпределяемыйТип.ПроизводственныйОбъектВЕТИС - подразделение
// 
// Возвращаемое значение:
//  Структура - найденное соответствие, см. ХозяйствующийСубъектИПредприятие()
//
Функция ХозяйствующийСубъектИПредприятиеПоОрганизацииИПодразделению(Организация,Подразделение) Экспорт
	
	Результат = ХозяйствующийСубъектИПредприятие();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация"   , Организация);
	Запрос.УстановитьПараметр("Подразделение" , Подразделение);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Субъект.Ссылка                                                                               КАК ХозяйствующийСубъект,
	|	ЕСТЬNULL(СубъектПредприятия.Предприятие, ЗНАЧЕНИЕ(Справочник.ПредприятияВЕТИС.ПустаяСсылка)) КАК Предприятие
	|ИЗ
	|	Справочник.ХозяйствующиеСубъектыВЕТИС КАК Субъект
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХозяйствующиеСубъектыВЕТИС.Предприятия КАК СубъектПредприятия
	|		ПО Субъект.Ссылка = СубъектПредприятия.Ссылка
	|		И СубъектПредприятия.ПроизводственныйОбъект = &Подразделение
	|ГДЕ
	|	НЕ Субъект.ПометкаУдаления
	|	И Субъект.Контрагент = &Организация";
	
	УстановитьПривилегированныйРежим(Истина);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
